#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
tfe_workspace.iac_ws["iac-azure-resources"]: Refreshing state... [id=ws-zj7feQucod5mRUag]
module.ansible_roles["ansible-role-k8s-certificates"].github_repository.repo: Refreshing state... [id=ansible-role-k8s-certificates]
module.azdo_terraform_pipeline_templates.github_repository.repo: Refreshing state... [id=azdo-terraform-pipeline-templates]
github_user_ssh_key.ssh_key_cultclassik: Refreshing state... [id=54706683]
module.ansible_roles["ansible-role-terraform"].github_repository.repo: Refreshing state... [id=ansible-role-terraform]
module.iac_github_mgmt.github_repository.repo: Refreshing state... [id=iac-github-mgmt]
github_actions_secret.tf_api_token["terraform-module-scaffolding"]: Refreshing state... [id=terraform-module-scaffolding:TF_API_TOKEN]
module.ansible_roles["ansible-role-vagrant"].github_repository.repo: Refreshing state... [id=ansible-role-vagrant]
github_actions_secret.tf_api_token["iac-azure-resources"]: Refreshing state... [id=iac-azure-resources:TF_API_TOKEN]
module.ansible_roles["ansible-role-kubetools"].github_repository.repo: Refreshing state... [id=ansible-role-kubetools]
module.iac_repos["iac-azure-resources"].github_repository.repo: Refreshing state... [id=iac-azure-resources]
module.terraform_module_repos["terraform-module-scaffolding"].github_repository.repo: Refreshing state... [id=terraform-module-scaffolding]
module.ansible_roles["ansible-role-cryptominer"].github_repository.repo: Refreshing state... [id=ansible-role-cryptominer]
module.ansible_roles["ansible-role-zsh"].github_repository.repo: Refreshing state... [id=ansible-role-zsh]
module.ansible_roles["ansible-role-git"].github_repository.repo: Refreshing state... [id=ansible-role-git]
module.ansible_roles["ansible-role-k8s-node"].github_repository.repo: Refreshing state... [id=ansible-role-k8s-node]
module.ansible_roles["ansible-role-docker"].github_repository.repo: Refreshing state... [id=ansible-role-docker]
module.ansible_control.github_repository.repo: Refreshing state... [id=ansible-control]
module.diehlabs_terraform_module_repos["terraform-azurerm-o365dns"].github_repository.repo: Refreshing state... [id=terraform-azurerm-o365dns]
github_actions_secret.iac_github_mgmt_tftoken: Refreshing state... [id=iac-github-mgmt:TF_API_TOKEN]
tfe_workspace.iac_github_mgmt: Refreshing state... [id=ws-MyypkggTqKQ9xbSY]
module.iac_github_mgmt.github_branch_default.default: Refreshing state... [id=iac-github-mgmt]
module.diehlabs_terraform_module_repos["terraform-azurerm-o365dns"].github_branch_default.default: Refreshing state... [id=terraform-azurerm-o365dns]
module.azdo_terraform_pipeline_templates.github_branch_default.default: Refreshing state... [id=azdo-terraform-pipeline-templates]
module.iac_repos["iac-azure-resources"].github_branch_default.default: Refreshing state... [id=iac-azure-resources]
module.terraform_module_repos["terraform-module-scaffolding"].github_branch_default.default: Refreshing state... [id=terraform-module-scaffolding]
module.ansible_roles["ansible-role-k8s-node"].github_branch_default.default: Refreshing state... [id=ansible-role-k8s-node]
module.ansible_roles["ansible-role-k8s-certificates"].github_branch_default.default: Refreshing state... [id=ansible-role-k8s-certificates]
module.ansible_roles["ansible-role-git"].github_branch_default.default: Refreshing state... [id=ansible-role-git]
module.ansible_roles["ansible-role-vagrant"].github_branch_default.default: Refreshing state... [id=ansible-role-vagrant]
module.ansible_roles["ansible-role-docker"].github_branch_default.default: Refreshing state... [id=ansible-role-docker]
module.ansible_roles["ansible-role-zsh"].github_branch_default.default: Refreshing state... [id=ansible-role-zsh]
module.ansible_roles["ansible-role-cryptominer"].github_branch_default.default: Refreshing state... [id=ansible-role-cryptominer]
module.ansible_roles["ansible-role-terraform"].github_branch_default.default: Refreshing state... [id=ansible-role-terraform]
module.ansible_roles["ansible-role-kubetools"].github_branch_default.default: Refreshing state... [id=ansible-role-kubetools]
module.ansible_control.github_branch_default.default: Refreshing state... [id=ansible-control]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.github_action_templates.data.github_branch.main will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "main"  {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = ".github"
      + sha        = (known after apply)
    }

  # module.github_action_templates.github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = ".github"
    }

  # module.github_action_templates.github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Github Workflow Templates - Repo Managed by Terraform - Repo managed by Terraform"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = ".github"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

  # module.iac_github_mgmt.data.github_branch.main will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "main"  {
      ~ etag       = "W/\"fca9257c7929e693d29102eb34fe4dfa12eefc6c432b514691d2dfde45f148c2\"" -> (known after apply)
      ~ id         = "iac-github-mgmt:main" -> (known after apply)
      ~ ref        = "refs/heads/main" -> (known after apply)
      ~ sha        = "9d589058309ded7e2480025d192dc9e0c3da36b9" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.iac_github_mgmt.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ description            = "Manages Github resources - Repo managed by Terraform" -> "Manages Github resources - Repo Managed by Terraform - Repo managed by Terraform"
        id                     = "iac-github-mgmt"
        name                   = "iac-github-mgmt"
        # (25 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @CultClassik, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Configuration Run`*